HW17/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

HW17/src/Catalogs/Контрагенты/Forms/ФормаЭлементаУпр/Module.bsl
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	СправчникОбъект = РеквизитФормыВЗначение("Объект");
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВРеквизитФормы(СправчникОбъект,"Объект");
	
	СправчникОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.Контрагенты"));
	СправчникОбъект.ФорматироватьНаименование();
	ЗначениеВДанныеФормы(СправчникОбъект,Объект);
	
КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьВидимостьПолей()
//	
//	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
//		Элементы.КПП.Видимость = Истина;
//		Элементы.ОГРН.Видимость = Истина;
//	Иначе
//		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
//		Элементы.КПП.Видимость = Ложь;
//		Элементы.ОГРН.Видимость = Ложь;
//	КонецЕсли;     
//	
//КонецПроцедуры // ()

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УстановитьВидимостьПолей();
//КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей()
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Видимость = Истина;
	Иначе
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОГРН.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПолей();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая()  Тогда // Проверяем что контрагент новый
		Ответ = Вопрос("Создать основной договор?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ =КодВозвратаДиалога.Да Тогда
			ПараметрыЗаписи.Вставить("Ответ", "Да"); //В структуру параметры записи пишем ответ да 
			Сообщить("Новый основной договор автоматически создан!");
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			ПараметрыЗаписи.Вставить("Ответ", "Нет");  //В структуру параметры записи пишем ответ нет
			Сообщить("Контрагент записан, основной договор автоматически не создан!");
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
			Сообщить("Контрагент не записан!");
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая()  Тогда  // Проверяем что контрагент новый
		Если ПараметрыЗаписи.Ответ = "Да" Тогда
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьНовыйОсновнойДоговор", Истина); //в дополнительные свойства пишем да в парметр "СОЗДАТЬДОГОВОР"
		ИначеЕсли ПараметрыЗаписи.Ответ = "Нет" Тогда 
			ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьНовыйОсновнойДоговор", Ложь);    //в дополнительные свойства пишем нет в парметр "СОЗДАТЬДОГОВОР"
		КонецЕсли;
	Иначе
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СоздатьНовыйОсновнойДоговор", Ложь);
	КонецЕсли;
	
КонецПроцедуры
